[
    {
        "ratings": {
            "5 star": "67%",
            "4 star": "19%",
            "3 star": "5%",
            "2 star": "3%",
            "1 star": "6%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "🚫🚫 DO NOT BUY 🚫🚫 1)For games- You can't play games even on medium graphics level. Always have a lagging issues or your server will get lost. Worst experience while playing PUBG. 2) Front camera - Don't fall for selfies pictures they are selling on page. no natural colors, gets all whitish look. Low light performance is bad. 3)Rear camera - Bad performance. Pictures are fuzzy. Videos are too shaky. Not worth to price. 4) Face unlock - Only after first day of use, face unlock started to stuck. 5) Battery discharges quickly. DON'T BUY IT",
                "review_posted_date": "08 Dec 2018",
                "review_header": "🚫WORST PERFORMANCE 🚫",
                "review_rating": "1.0 ",
                "review_author": "Pramod"
            },
            {
                "review_comment_count": "",
                "review_text": "I bought this phone on first sale. It looks gud, gives u feel in hand, comfortable grip and gud performance during games. But contrary to ther statement of best camera phone, this one is the worst. Rear camera images r blurr, hazzy and if u zoom they r very grainy. Color reproduction is poor. In portrait mode nothing works properly, it can't differentiate the object from background. In low light degraded performance persists. Talking about front camera images only look gud but when u zoom the images, output is always grainy even in day light. Night images are intermittent u may c same object with same lights n background appears differently some time they r gud but other times they may b out of focus, hazzy and overall images r always grainy.",
                "review_posted_date": "09 Dec 2018",
                "review_header": "Very poor camera performance",
                "review_rating": "2.0 ",
                "review_author": "Ranpreet S Marwah"
            },
            {
                "review_comment_count": "",
                "review_text": "This phone is nothing less than Realme 2 pro but its also an improved version of realme 2 pro and Color OS. Little Bigger display than Realme 2 pro, battery issue which i faced in Realme 2 pro is fixed in U1. It doesn't drain quickly and charges the phone at an average good time. Selfie camera is awesome and primary camera is slightly better than Realme pro 2. Phone's performance is equally same as realme 2 pro, so cant really say about the processor. Both SD 660 and P70 is winner. Design and built quality is same, nothing metallic, so using the free case which I've received along with it . Facing little data connectivity issue, but cant say if the problem is with the phone, it could be network issue. Didn't receive the earphone in the box. Why phone companies have stopped sending earphones with the phone? I guess, there are very few phones which come up with the in-box earphone. Audio quality is good, enjoyed the loudness without earphone, better and louder any other phone. The display is not very bright, it could have been slightly bright like Redmi or Huawei's phones. But the video quality is amazing, you'll love watching movies in FHD and the dewdrop notch is so perfect to make your viewing experience fantastic. Few improvements in Color OS. Finally, we can close the notification by simply sliding towards the right side with the finger. Apps' icons are little smaller in comparison with other realme phones. Its been 1 days since I got my hands on the phone, many more things to see and notice on this phone. Will leave my next review in Jan, 2019",
                "review_posted_date": "09 Dec 2018",
                "review_header": "Value for money. Great phone at this price.",
                "review_rating": "4.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "Good phone. Fast delivery by amazon. Pros 1 camera quality both selfie and back are awesome 2. Battery back up is good 3.Good buid quality 4 finger print and face unlock both works smooth 5 network connectivity and internet speed better than other phone like samsung MI Cons 1 no fast charger take almost 2 hour to charge 100 percent 2 no ear phone 3 no fast charger 4 no notification led",
                "review_posted_date": "08 Dec 2018",
                "review_header": "Real me U1",
                "review_rating": "4.0 ",
                "review_author": "Rahul Joshi"
            },
            {
                "review_comment_count": "",
                "review_text": "I orderded this set in the first sale 3gb 32gb variant and its totally value for money. Plus I have not expected the sound quality to be such of a level and the display in itself is eye catching. Front camera stands up to the mark as the company promised and rear camers is also good",
                "review_posted_date": "08 Dec 2018",
                "review_header": "Amazing mobile",
                "review_rating": "5.0 ",
                "review_author": "Prashant Trivedi"
            },
            {
                "review_comment_count": "",
                "review_text": "It's really worth the money..been using this for past 4 days..firstly I want to thank you for super fast delivery.the feature this phone have are too good .this device Does no lag,the main thing is it's super front camera just loved it..since I gamer I have test most of the heavy games everything runs smoothly on high settings..thanks for this super and budget friendly smart phone realme.i am very happy that I purchased it .",
                "review_posted_date": "08 Dec 2018",
                "review_header": "Best in class performer!!!loved it",
                "review_rating": "5.0 ",
                "review_author": "Sikandar baig"
            },
            {
                "review_comment_count": "",
                "review_text": "Must buy product as i compared both oppo f9 pro and realme u1 and u1 performs somewhere better than f9 pro and i suggest must buy this product if your budget is near about 10 to 13 thousand.",
                "review_posted_date": "08 Dec 2018",
                "review_header": "Best product ever just because of helio p70",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "Camera is not as expected its like a 13 mp.... Remaimimg all are verry good..",
                "review_posted_date": "08 Dec 2018",
                "review_header": "Camera is not good",
                "review_rating": "2.0 ",
                "review_author": "Satya"
            }
        ],
        "url": "http://www.amazon.in/dp/https://www.amazon.in/Realme-Ambitious-Black-32GB-Storage/dp/B07HGH3CGB",
        "name": "Realme U1 (Ambitious Black, 3GB RAM, 32GB Storage)",
        "price": ""
    }
]